In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
df = pd.DataFrame(randn(4,3),["q","w","e","f"],["Column1","Column2","Column3"])

In [3]:
df

    Column1   Column2   Column3
q -0.317416 -3.063670 -0.347729
w  1.472054 -0.361339 -1.306427
e -0.692229  0.435034 -1.295258
f  0.223878 -0.237519  2.270222

In [4]:
df> -1

   Column1  Column2  Column3
q     True    False     True
w     True     True    False
e     True     True    False
f     True     True     True

In [5]:
df>=1

   Column1  Column2  Column3
q    False    False    False
w     True    False    False
e    False    False    False
f    False    False     True

In [6]:
df> 0

   Column1  Column2  Column3
q    False    False    False
w     True    False    False
e    False     True    False
f     True    False     True

In [7]:
df == 0

   Column1  Column2  Column3
q    False    False    False
w    False    False    False
e    False    False    False
f    False    False    False

In [8]:
booleanDf = df > 0

In [9]:
booleanDf

   Column1  Column2  Column3
q    False    False    False
w     True    False    False
e    False     True    False
f     True    False     True

In [10]:
df[booleanDf]

    Column1   Column2   Column3
q       NaN       NaN       NaN
w  1.472054       NaN       NaN
e       NaN  0.435034       NaN
f  0.223878       NaN  2.270222

In [11]:
#true olanları bu şekilde görebiliyoruz false olanlar ise not a number olarak yer alıyor.

In [12]:
df[df>0]

    Column1   Column2   Column3
q       NaN       NaN       NaN
w  1.472054       NaN       NaN
e       NaN  0.435034       NaN
f  0.223878       NaN  2.270222

In [13]:
#bu şekilde de ifade edebiliriz.

In [14]:
df["Column2"]

q   -3.063670
w   -0.361339
e    0.435034
f   -0.237519
Name: Column2, dtype: float64

In [15]:
df["Column2"] > 0

q    False
w    False
e     True
f    False
Name: Column2, dtype: bool

In [16]:
df[df["Column2"] > 0]

    Column1   Column2   Column3
e -0.692229  0.435034 -1.295258

In [17]:
df[df["Column2"] > 0.5]

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [18]:
df["Column1"] > -(0.5)

q     True
w     True
e    False
f     True
Name: Column1, dtype: bool

In [19]:
#bunu bir df içerisine yazarsak bize sırasıyla q,w,e yazdırılır f ise yazdırılmaz çünkü değeri false...

In [20]:
df[df["Column1"] > -(0.5)]

    Column1   Column2   Column3
q -0.317416 -3.063670 -0.347729
w  1.472054 -0.361339 -1.306427
f  0.223878 -0.237519  2.270222

In [21]:
df[df["Column1"] > -(0)]

    Column1   Column2   Column3
w  1.472054 -0.361339 -1.306427
f  0.223878 -0.237519  2.270222

In [22]:
df[df["Column2"]>0]

    Column1   Column2   Column3
e -0.692229  0.435034 -1.295258

In [23]:
#pandasta iki koşulun aynı anda sağlandığı bir sorgu yazarken and kullanamıyoruz pandas bunu kabul etmiyor bunun yerine & kullanıyoruz...

In [24]:
df[(df["Column2"] > 0.5) & (df["Column3"] > 0) ]

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [25]:
df[(df["Column2"] > 0.5) | (df["Column3"] > 0) ]

    Column1   Column2   Column3
f  0.223878 -0.237519  2.270222

In [26]:
#pandas and operatörüne müsade etmediği gibi or bağlacınada müsade etmiyor.Bu yüzden | kullanarak işlemimizi yapıyoruz.

In [27]:
#mevcut dataframe tekrar bakalım

In [28]:
df

    Column1   Column2   Column3
q -0.317416 -3.063670 -0.347729
w  1.472054 -0.361339 -1.306427
e -0.692229  0.435034 -1.295258
f  0.223878 -0.237519  2.270222

In [29]:
#bu yapımıza tekrar bir dataframe eklemek istersek = 
df["Column58"] =pd.Series(randn(4),["q","w","e","f"])

In [30]:
df

    Column1   Column2   Column3  Column58
q -0.317416 -3.063670 -0.347729 -0.503976
w  1.472054 -0.361339 -1.306427 -0.880984
e -0.692229  0.435034 -1.295258 -1.063928
f  0.223878 -0.237519  2.270222 -0.687606

In [31]:
#dikkat ettiysek inplace=True yapımızı kullanmadık...

In [32]:
df["Column5"] = randn(4)

In [33]:
df

    Column1   Column2   Column3  Column58   Column5
q -0.317416 -3.063670 -0.347729 -0.503976 -0.610889
w  1.472054 -0.361339 -1.306427 -0.880984 -1.244594
e -0.692229  0.435034 -1.295258 -1.063928  0.948486
f  0.223878 -0.237519  2.270222 -0.687606 -1.146257

In [34]:
#en kolay Column ekleme yöntemi olarak bir üst satırı kullanabilirsiniz.

In [35]:
df["Column85"] = ["newValue1","newValue2","newValue3","newValue4"]

In [36]:
df

    Column1   Column2   Column3  Column58   Column5   Column85
q -0.317416 -3.063670 -0.347729 -0.503976 -0.610889  newValue1
w  1.472054 -0.361339 -1.306427 -0.880984 -1.244594  newValue2
e -0.692229  0.435034 -1.295258 -1.063928  0.948486  newValue3
f  0.223878 -0.237519  2.270222 -0.687606 -1.146257  newValue4

In [37]:
df.set_index("Column85",inplace=True)

In [38]:
df

            Column1   Column2   Column3  Column58   Column5
Column85
newValue1 -0.317416 -3.063670 -0.347729 -0.503976 -0.610889
newValue2  1.472054 -0.361339 -1.306427 -0.880984 -1.244594
newValue3 -0.692229  0.435034 -1.295258 -1.063928  0.948486
newValue4  0.223878 -0.237519  2.270222 -0.687606 -1.146257

In [39]:
df.index.names

FrozenList(['Column85'])